[
  {
    "company_name":"Back Barn Brewery",
    "company_url":"https://untappd.com/BackBarnBrew",
    "advisor_name":"Klaus",
    "advisor_contact":"",
    "advisor_position":"",
    "location_city":"Delanson",
    "location_state":"NY",
    "time_start":"2022-04",
    "time_end":"present",
    "position":"Assistant Brewer",
    "tags": ["craft"],
    "responsibilities": [
      "Assist the head brewer in brewing a variety of beer styles from milling, through runoff, and fermentation"
    ],
    "summary_short":"Assist the head brewer in brewing a variety of beer styles from milling, through runoff, and fermentation"
  },
  {
    "company_name":"[Local] Distillery",
    "company_url":"",
    "advisor_name":"",
    "advisor_contact":"",
    "advisor_position":"",
    "location_city":"",
    "location_state":"NY",
    "time_start":"2021-10",
    "time_end":"present",
    "position":"Apprentice Distiller, Rickhouse Manager",
    "tags": ["craft"],
    "responsibilities": [
      "Production of various spirits including numerous whiskeys, gin, and vodka",
      "Milling, mashing, fermenting, stripping, distilling, barreling, storing, and harvesting whiskey",
      "The organization and management of millions of dollars of barreled product"
    ],
    "summary_short":"Involved with each process in the production of a variety of distilled spirits and their storage in a two-story, on-site rickhouse."  
  },
  {
    "company_name":"[Local] Volunteer Fire Department",
    "company_url":"",
    "advisor_name":"",
    "advisor_contact":"",
    "advisor_position":"Chief",
    "location_city":"",
    "location_state":"NY",
    "time_start":"2020-07",
    "time_end":"present",
    "position":"Volunteer Firefighter/EMT",
    "tags": ["ems","fire"],
    "responsibilities": [
      "Respond to fire, vehicle, and medical emergencies as a volunteer firefighter and/or EMT",
      "Attend regular meetings and drills",
      "Conduct periodic inventories on our ambulances"
    ],
    "summary_short":"On-call response to life-threatening incidents in the surrounding county involving fires, motor-vehicle accidents, rescue, and medical emergencies."  
  },
  {
    "company_name":"Boston University Libraries",
    "company_url":"http://www.bu.edu/library/",
    "company_img":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Boston_University_wordmark.svg/800px-Boston_University_wordmark.svg.png",
    "advisor_name":"Michael Ward",
    "advisor_contact":"mrward@bu.edu",
    "advisor_position":"Web Services Manager",
    "location_city":"Boston",
    "location_state":"MA",
    "time_start":"2018-09",
    "time_end":"2020-09",
    "position":"Web Developer",
    "tags": ["library","software"],
    "languages": ["js","html","css","scss","python"],
    "technologies": ["github","web-components","lit-element","lit-html","circle-ci","angular"],
    "responsibilities": [
      "Architected, implemented, documented, and maintained a new front-end strategy built on portability, maintainability, open source collaboration, and modular reuse.",
      "Maintained and contributed to a collection of open source packages used by libraries across the world to add functionality to the ExLibris Primo search interface.",
      "Helped to manage, customize, brand, and improve the usability of the BU Libraries' web presence across a number of hosted vendor platforms.",
      "Periodically assisted members of the library in acquiring information about works published by BU researchers and managing metadata from our collections.",
      "Created and expanded upon a custom library of web components, powering a more consistent, feature-rich, and data-driven user experience and branding across a variety of sites."
    ],
    "summary_short":"As the sole developer on a small Web Services Team, I was able to build out an infrastructure and long-term strategy while creating immediate value redesigning multiple sites, creating open-source customizations, and standardizing cross-site branding/UX.",
    "summary_long":"My time at BU Libraries afforded me the unique opportunity to architect simple solutions to complex problems in an open-source environment. I was able to investigate, develop, maintain, and even present about new and developing technologies that I wasn’t able to use elsewhere and solve a problem with multi-site management that frustrated many in the industry. While at BU, every commit I made was publicly available and I could create and contribute to packages that are used around the world."
  },
  {
    "company_name":"ITHAKA - JSTOR",
    "company_url":"ithaka.org",
    "company_img":"https://p6.zdassets.com/hc/theme_assets/1006386/200489087/JSTOR_Logo2017_370.png",
    "advisor_name":"Peter Vlahakis",
    "advisor_contact":"peter.vlahakis@ithaka.org",
    "advisor_position":"Product Owner",
    "location_city":"Ann Arbor",
    "location_state":"MI",
    "time_start":"2017-01",
    "time_end":"2018-06",
    "position":"Junior Web Application Developer",
    "tags": ["software", "publishing", "library", "research"],
    "languages": ["python","html","scss","java"],
    "technologies": ["django", "github", "aws", "jira" ],
    "responsibilities": [
      "Contributed over 250 pull requests (and reviewed over 500) into a dozen repositories in six languages.",
      "Worked as one of three developers on an agile, cross-functional product team, utilizing test-driven development (TDD), and often deploying to production multiple times a week.",
      "Contributed in a distributed effort across front-end teams toward a site-wide visual redesign.",
      "Built and improved upon the JSTOR 'For Librarians' portal (jstor.org/librarians) to help libraries better understand our collections of ebooks, ejournals, and primary sources.",
      "Assisted in the design and architecture of a tool to provide insights on the usage of those collections via COUNTER usage statistic reporting.",
      "Built and improved upon the new JSTOR 'For Librarians' portal to assist librarians in better understanding our collections of ebooks, ejournals, and primary sources.",
      "Supported, redesigned, and rebuilt a tool for acquiring data for use in text and data mining practices."
    ],
    "summary_short":"I served as one of three developers responsible for the creation, maintenance, and improvement/expansion of the JSTOR For Librarians portal",
    "summary_long":"I was an integral member of a six person team creating a new web portal in the main repository of the company's site. I worked mostly within the django web framework to create multiple applications librarians are using to investigate the products JSTOR has for sale, to understand the value the items they purchased, and to provide the resources necessary for making data-driven decisions to plan new acquisitions. I was present from the initial steps of planning and iterative development through to the traffic-segmented release and the ideation of future modules.<br /><br />The work took place in a microservices environment leveraging the traditional github workflow, boasting over 300 microservices and over 200 deployments a week.<br /><br /> I routinely submitted and reviewed multiple pull requests per day, and monitored the progression of my work independently through each stage of the pipeline. In addition to my main work creating the portal, I was responsible for leading the recovery effort and maintenance, and for designing the microservices integration of a legacy, standalone application into the greater microservices ecosystem."
  },
  {
    "company_name":"EagleDream Technologies",
    "company_url":"eagledream.com",
    "company_img":"http://eagledream.com/wp-content/uploads/2015/02/edt_logo_sticky_color_2.png?868103",
    "advisor_name":"Scott Telle",
    "advisor_contact":"scott.telle@eagledream.com",
    "advisor_position":"Senior Software Developer",
    "location_city":"Rochester",
    "location_state":"NY",
    "time_start":"2015-06",
    "time_end":"2015-12",
    "position":"Software Development Intern",
    "tags": ["software"],
    "languages": ["java","C#","aws"],
    "technologies": ["hibernate","spring","AD","VoIP","jira","git"],
    "responsibilities": [
      "Designed and developed a desktop application integrating batch user data between disparate systems.",
      "Improved and maintained a java application for managing, storing, and displaying electronic medical records in compliance with rigid governmental standards.",
      "Web Services Transition: responsible for planning, documenting, and beginning a migration from local hosting over a dozen wordpress sites onto the cloud."
    ],
    "summary_short":"Worked on a number of projects developing information management software applications for external companies with concrete requirements and compressed timelines.",
    "summary_long":"EDT was my first internship experience in the Software Engineering field. I was afforded the opportunity to work on multiple projects using the SCRUM methodology and informal code review, and to learn AWS and C#/Visual Studio on the job. The experience underscored the importance of balancing code quality/documentation with timely delivery and polish."
  },
  {
    "company_name":"Wallace Library",
    "company_url":"library.rit.edu",
    "company_img":"",
    "advisor_name":"Teresa Kellett",
    "advisor_contact":"tmkwml@rit.edu",
    "advisor_position":"Library Systems Support Analyst",
    "location_city":"Rochester",
    "location_state":"NY",
    "time_start":"2016-02",
    "time_end":"2016-12",
    "position":"Digital Initiatives/Metadata Services Worker",
    "tags": ["software","library"],
    "languages": ["java","json"],
    "technologies": ["photoshop","acrobat","github","dspace","SAFBuilder","ScanTailor"],
    "responsibilities": [
      "Rendered, enhanced, described, and managed volumes from a physical archive and batch imported the resulting digitized items to the DSpace digital media library.",
      "Assisted with the creation of an updated protocol for the digitization process, incorporating my work with 'dublin-core-text-parser' - a tool to increase the richness and production rate of our metadata."
    ],
    "summary_short":"My time working at the Wallace Center has afforded me firsthand experience of the operative practices, needs, strengths, and weaknesses of libraries, as well as their critical importance to the process of knowledge creation and management.",
    "summary_long":"My experience in the Digital Initiatives department underscored the importance of my field and the tremendous impact it could have on library science and knowledge management.</br></br>The opportunity for progress in the specific areas of standardization, deduplication, automation, tooling, APIs, and data mining is really inspiring, and the capacity to make a difference both in the immediate short-term and in the distant long term has solidly reinforced my trajectory into LIS and LAM software."
  },
  {
    "company_name":"Rochester Institute of Technology - Chemistry Department",
    "company_url":"https://www.rit.edu/science/scms",
    "company_img":"",
    "advisor_name":"Dr. Paul Craig",
    "advisor_contact":"pac8612@rit.edu",
    "advisor_position":"Chemistry Department Head",
    "location_city":"Rochester",
    "location_state":"NY",
    "time_start":"2012-08",
    "time_end":"2014-12",
    "position":"Developer/Maintainer",
    "tags": ["software","research"],
    "languages": ["java"],
    "responsibilities": [
      "Developed, maintained, and refactored a series of proteomics simulations for the education of AP high school and beginning undergraduate Biochemistry/Biotechnology students.",
      "Assisted in creating questionnaires, walkthroughs, and help information to test user experience and comprehension of the software",
      "Assisted in conducting user tests, interpreting their findings, and planning subsequent changes to the application."
    ],
    "summary_short":"I learned a great deal about refactoring, documentation, communication, legacy code maintenance, usability testing, and research software working with JBioFramework.",
    "summary_long":"I learned a great deal about refactoring, documentation, communication, legacy code maintenance, usability testing, and research software working with JBioFramework. Having this experience from the beginning of my educational career and throughout it, gave me an important perspective on the discipline I would not have got otherwise."
  },
  {
    "company_name":"University of Maine Presque Isle",
    "company_url":"www.umpi.edu",
    "company_img":"",
    "advisor_name":"Dr. Jason Johnston",
    "advisor_contact":"jason.johnston@maine.edu",
    "advisor_position":"Professor",
    "location_city":"Presque Isle",
    "location_state":"ME",
    "time_start":"2011-03",
    "time_end":"2011-09",
    "position":"Research Assistant/Lab Aid",
    "tags": ["research","science"],
    "languages": [],
    "technologies": ["microsoft access","mendeley"],
    "responsibilities": [
      "Conducted a literature search and review to assist in the design and description of research methods and data analysis.",
      "Assisted with the organization and analysis of scientific data and their visualization using Microsoft Access and Excel.",
      "Coordinated the physical and digital storage of collected articles and their metadata.",
      "Performed various lab procedures to extract DNA and analyze hormone levels from samples of bird blood.",
      "Collected blood samples from live birds in the field via lure, entrapment, and release."
    ],
    "summary_short":"My work with Dr. Johnston was my first experience with scientific research, and one of the things that first got me interested in a career devoted to accelerating the knowledge industries.",
    "summary_long":"My work with Dr. Johnston was my first experience with scientific research and literature review. In using the technologies and processes involved in scientific discovery, I witnessed firsthand the scale of the temporal, financial, and informational resources involved in the process, and the vast potential of software to have an accelerative effect on it."
  }
]
